app/controllers/articulos_controller.rb

SELECT * FROM `articulos` WHERE (UPPER(nombre) like '%%') ORDER BY nombre LIMIT 0, 4
---
  def index
    @articulos = Articulo.search(params[:search], params[:page])

SELECT * FROM `articulos` WHERE (`articulos`.`id` = 42)
---
  def show
    @articulo = Articulo.find(params[:id])

SELECT * FROM `lineas_productos`
---
  def new
    @articulo = Articulo.new
    @lineas_productos = LineasProducto.all

SELECT * FROM `lineas_productos`
INSERT INTO `articulos` (`referencia`, `foto_updated_at`, `nombre`, `talla`, `lote`, `foto_file_size`, `lineas_producto_id`, `color_id`, `foto_content_type`, `foto_file_name`, `ubicacion`, `marca`, `peso`) VALUES('Seven', '2010-11-01 23:27:31', 'Windows', 's', 'pirateria', 1332565, 1, 8, 'image/jpeg', 'Broken_Windows_7_by_smuggle559.jpg', 'calentraba', 'Microsoft', '1')
---
  def create
    @articulo = Articulo.new(params[:articulo])
     @lineas_productos = LineasProducto.all
    respond_to do |format|
      if @articulo.save

SELECT * FROM `articulos` WHERE (`articulos`.`id` = 41)
DELETE FROM `articulos` WHERE `id` = 41
---
  def destroy
    @articulo = Articulo.find(params[:id])
    @articulo.destroy