app/controllers/articulos_clientes_controller.rb

SELECT * FROM `articulos_clientes` WHERE (`articulos_clientes`.cliente_id = 8)
SELECT * FROM `articulos` WHERE (`articulos`.`id` = 8)
SELECT * FROM `clientes` WHERE (`clientes`.`id` = 8)
---
  def index
    #@articulos_clientes = ArticulosCliente.all
    @articulos_clientes = @cliente.articulos_clientes.find(:all)

SELECT * FROM `articulos`
SELECT * FROM `sedes`
---
  def new
    @articulos_cliente = ArticulosCliente.new
    @articulos = Articulo.all
    @sedes = Sede.all

INSERT INTO `articulos_clientes` (`cliente_id`, `total_articulos`, `sede_id`, `articulo_id`) VALUES(11, 5, 2, 42)
---
  def create
    @articulos_cliente = ArticulosCliente.new(params[:articulos_cliente])
    @articulos_cliente.cliente_id = @cliente.id
    respond_to do |format|
      if @articulos_cliente.save

SELECT * FROM `articulos_clientes` WHERE (`articulos_clientes`.`id` = 17)
SELECT * FROM `clientes` WHERE (`clientes`.`id` = 11)
DELETE FROM `articulos_clientes` WHERE `id` = 17
---
  def destroy
    @articulos_cliente = ArticulosCliente.find(params[:id])
    @articulos_cliente.destroy

SELECT * FROM `clientes` WHERE (`clientes`.`id` = 11)
---
def find_cliente_and_articulos_cliente
@cliente = Cliente.find(params[:cliente_id])