app/controllers/clientes_controller.rb

SELECT * FROM `clientes` WHERE (nombre like '%%') ORDER BY nombre LIMIT 0, 4
---
  def index
  @clientes = Cliente.search(params[:search], params[:page])

SELECT * FROM `clientes` WHERE (`clientes`.`id` = 10)
---
  def show
    @cliente = Cliente.find(params[:id])

INSERT INTO `clientes` (`foto_updated_at`, `apellido`, `cedula`, `nombre`, `municipio_id`, `foto_file_size`, `nit`, `foto_content_type`, `foto_file_name`, `direccion`, `email`) VALUES('2010-11-01 23:30:11', 'Rios Cano', '1234567', 'Juan Camilo', 57005001, 65048, '123456', 'image/jpeg', '37281_434992844244_745799244_5935130_4246079_n.jpg', 'fsaddfasf', 'rios17@hotmail.es')
---
  def create
    @cliente = Cliente.new(params[:cliente])
    @cliente.municipio_id = params[:chain_select][:municipio]
    respond_to do |format|
      if @cliente.save

SELECT * FROM `clientes` WHERE (`clientes`.`id` = 10)
---
  def destroy
    @cliente = Cliente.find(params[:id])