app/controllers/contactos_controller.rb

SELECT * FROM `contactos` WHERE (`contactos`.cliente_id = 11)
---
  def index
   # @contactos = Contacto.all
    @contactos = @cliente.contactos.find(:all)

SELECT * FROM `contactos` WHERE (`contactos`.`id` = 1)
---
  def show
    @contacto = Contacto.find(params[:id])

SELECT * FROM `contactos` WHERE (`contactos`.`id` = 1)
---
  def edit
    @contacto = Contacto.find(params[:id])

INSERT INTO `contactos` (`descripcion`, `tipo_contacto`, `cliente_id`) VALUES('Comprador excelente', 'Cliente Mayorista', 11)
---
  def create
    @contacto = Contacto.new(params[:contacto])
    @contacto.cliente_id = @cliente.id
    respond_to do |format|
      if @contacto.save

SELECT * FROM `contactos` WHERE (`contactos`.`id` = 1)
---
  def update
    @contacto = Contacto.find(params[:id])

SELECT * FROM `clientes` WHERE (`clientes`.`id` = 11)
---
  def find_cliente_and_contacto
  @cliente = Cliente.find(params[:cliente_id])