app/controllers/existenciasedes_controller.rb

SELECT * FROM `existenciasedes` WHERE (cantidad like '%%') AND (`existenciasedes`.articulo_id = 42) ORDER BY cantidad LIMIT 0, 5
---
  def index
    @existenciasedes = @articulo.existenciasedes.search(params[:search], params[:page])

SELECT * FROM `existenciasedes` WHERE (`existenciasedes`.`id` = 17)
SELECT * FROM `sedes` WHERE (`sedes`.`id` = 2)
---
  def show
    @existenciasede = Existenciasede.find(params[:id])

SELECT * FROM `sedes`
---
  def new
    @existenciasede = Existenciasede.new
    @sedes = Sede.all

INSERT INTO `existenciasedes` (`cantidad`, `sede_id`, `articulo_id`) VALUES('4564', 2, 42)
---
  def create
    @existenciasede = Existenciasede.new(params[:existenciasede])
     @existenciasede.articulo_id = @articulo.id

    respond_to do |format|
      if @existenciasede.save

SELECT * FROM `articulos` WHERE (`articulos`.`id` = 42)
SELECT * FROM `sedes` WHERE (`sedes`.`id` = 2)
---
  def find_articulo_and_existenciasede
      @articulo = Articulo.find(params[:articulo_id])
      @existenciasede = Existenciasede.find(params[:id]) if params[:id]