app/controllers/lineas_productos_controller.rb

SELECT * FROM `lineas_productos`
---
  def index
    @lineas_productos = LineasProducto.all