app/controllers/materiasprimas_controller.rb

SELECT * FROM `materiasprimas` WHERE (`materiasprimas`.articulo_id = 42)
---
  def index

   @materiasprimas = @articulo.materiasprimas.find(:all)

SELECT * FROM `articulos` WHERE (`articulos`.`id` = 42)
---
def find_articulo_and_materiasprima
@articulo = Articulo.find(params[:articulo_id])