app/controllers/movimientos_inventarios_controller.rb

  def index
    @movimientos_inventarios = MovimientosInventario.all
---
SELECT * FROM `movimientos_inventarios`

  def new
    @movimientos_inventario = MovimientosInventario.new
    @tipos_movimientos = TiposMovimiento.all
---
SELECT * FROM `tipos_movimientos`