app/controllers/tipos_movimientos_controller.rb

SELECT * FROM `tipos_movimientos`
---
  def index
    @tipos_movimientos = TiposMovimiento.all